Grouping & Aggregation of Data
- groupby( )
- mean/ sum / max / min / count etc.
- agg( )

In [2]:
import pandas as pd

In [ ]:
df = pd.read_csv("cleaned_data.csv")
df = df.drop(columns="Unnamed: 0")
df

   id          name  age country   gender   income
0   1      John Doe   29     USA     Male  55000.0
1   2    Jane Smith   33  Canada   Female  62000.0
2   3          Alex   33     USA  Unknown  47000.0
3   4  Maria Garcia   34   Spain   Female  57889.0
4   5        Li Wei   27   China     Male  51000.0
5   6        Li Wei   45   India   Female  73000.0
6   7    Ahmed Khan   38   India     Male  68000.0
7   8    Rachel Lee   29     USA   Female  62000.0
8   9   Carlos Ruiz   33  Mexico     Male  45000.0
9  10   Emily Davis   31     USA     Male  58000.0

In [10]:
df.groupby("country")["income"].mean()
df.groupby("country")["income"].min()
df.groupby("country")["income"].max()

df.groupby("country")["income"].agg(avg_salary = "mean", median_salary= "median", min_salary = "min", max_salary = "max")

         avg_salary  median_salary  min_salary  max_salary
country
Canada      62000.0        62000.0     62000.0     62000.0
China       51000.0        51000.0     51000.0     51000.0
India       70500.0        70500.0     68000.0     73000.0
Mexico      45000.0        45000.0     45000.0     45000.0
Spain       57889.0        57889.0     57889.0     57889.0
USA         55500.0        56500.0     47000.0     62000.0

In [12]:
df.groupby("country").agg({
    "income": "mean",
    "age": "mean"
})

df.groupby("country").agg(
    avg_income = ("income", "mean"),
    avg_age = ("age", "mean")
)

         avg_income  avg_age
country
Canada      62000.0     33.0
China       51000.0     27.0
India       70500.0     41.5
Mexico      45000.0     33.0
Spain       57889.0     34.0
USA         55500.0     30.5